In [1]:
import pandas as pd
import sqlite3
from sqlalchemy import create_engine
import random
import datetime

In [2]:
pd.options.display.max_colwidth = 50

In [23]:
engine = create_engine("mysql://root@localhost/parkzen")

In [4]:
with engine.connect() as conn, conn.begin():
    lat_lon = pd.read_sql_table(table_name='app_location', con=conn)

In [5]:
lat_lon.shape

(50, 5)

In [12]:
def gen_random_address():
    number = ['123', '12/3', '#77', '56 & 57', '49A', 'B32']
    street = ['MG Road', 'Bannerghatta Road', 'Mysore Rd', 'Sampige Rd', 'Church St', 'Hosur Rd']
    area = ['Jayanagar', 'Indiranagar', 'JP Nagar', 'Malleshwaram']
    city = 'Bangalore'
    pincode = ['560078', '560002', '560103', '560121']
    address = ', '.join([
        random.sample(population=number, k=1)[0], 
        random.sample(population=street, k=1)[0], 
        random.sample(population=area, k=1)[0],
        city + ' ' + random.sample(population=pincode, k=1)[0]
    ])
    return address

In [13]:
lat_lon['address'] = lat_lon['address'].apply(lambda a: gen_random_address())

In [30]:
lat_lon.head()

,lat,lon,user_id,address
0,12.907909,77.607073,2,"56 & 57, Mysore Rd, Jayanagar, Bangalore 560121"
1,12.907506,77.607736,3,"56 & 57, Mysore Rd, Indiranagar, Bangalore 560078"
2,12.912361,77.602853,1,"B32, Sampige Rd, Malleshwaram, Bangalore 560103"
3,12.906575,77.602821,3,"56 & 57, Sampige Rd, Malleshwaram, Bangalore 5..."
4,12.911095,77.599719,1,"123, Mysore Rd, JP Nagar, Bangalore 560078"

In [28]:
lat_lon.drop(labels='id', inplace=True, axis=1)

In [32]:
lat_lon2 = lat_lon[['user_id', 'lat', 'lon', 'address']]

In [35]:
with engine.connect() as conn, conn.begin():
    lat_lon2.to_sql(name='app_location', con=conn, if_exists='append', index=False)

In [28]:
lat_lon.drop(labels='id', inplace=True, axis=1)

In [17]:
lat_lon.to_sql?

In [21]:
with engine.connect() as conn, conn.begin():
    users = pd.read_sql_table(table_name='auth_user', con=conn)

In [25]:
users

,id,password,last_login,is_superuser,username,first_name,last_name,email,is_staff,is_active,date_joined
0,1,pbkdf2_sha256$100000$mMR4QmyIZ7A4$i2a8/l0ZvzPA...,2018-05-05 08:39:27.772542,1,navaneethan,,,,1,1,2018-05-05 08:39:07.685361
1,2,pbkdf2_sha256$100000$Ej8iMPPaqMuP$fQnz1tnOD5Lq...,NaT,0,ankit,,,,0,1,2018-05-05 08:39:43.404826
2,3,pbkdf2_sha256$100000$OPPxp8HYFZbG$blxWz460JopK...,NaT,0,hruthika,,,,0,1,2018-05-05 08:39:56.681942

In [34]:
with engine.connect() as conn, conn.begin():
    users.to_sql(name='auth_user', con=conn, if_exists='append', index=False)